kilojoules-kj/EE2028-STM32/Core/Src/main.c
 /******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  * (c) EE2028 Teaching Team
  ******************************************************************************/


/* Includes ------------------------------------------------------------------*/
#include "main.h"
// Peripherals
#include "../../Drivers/BSP/B-L4S5I-IOT01/stm32l4s5i_iot01_tsensor.h"
#include "../../Drivers/BSP/B-L4S5I-IOT01/stm32l4s5i_iot01_psensor.h"
#include "../../Drivers/BSP/B-L4S5I-IOT01/stm32l4s5i_iot01_hsensor.h"
#include "../../Drivers/BSP/B-L4S5I-IOT01/stm32l4s5i_iot01_accelero.h"
#include "../../Drivers/BSP/B-L4S5I-IOT01/stm32l4s5i_iot01_gyro.h"
#include "../../Drivers/BSP/B-L4S5I-IOT01/stm32l4s5i_iot01_magneto.h"
// Input Output
#include "stdio.h"
// Math.abs
#include <stdlib.h>
// Types
#include "stdbool.h"
#include "string.h"


// GPIO
static void MX_GPIO_Init(void);

// Global Variables
// extern void initialise_monitor_handles(void);	// Log for semi-hosting support (printf)
static void UART1_Init(void); // UART Serial RxTx
static UART_HandleTypeDef huart1; // Serial RxTx
static ADC_HandleTypeDef ADC_HandlerLightSensor;

/* Grove - OLED Display 0.96inch - SSD1308 - width in pixels */
#define SSD1308_WIDTH 128
/* SSD1308 height in pixels */
#define SSD1308_HEIGHT 64
/* SSD1308 I2C Address */
#define SSD1308_ADDR (0x3C << 1) // 0x3C is 7bits but HAL expects 8bits
static I2C_HandleTypeDef hi2c1;
#define I2C_SPEED_HZ 4000000  // The same as System Clock
#define PCLK1_FREQ_HZ 4000000  //

int BUTTON_DURATION = 600; // 600 tick/ms for GetTick()
static bool buttonActive = false;
static bool isPlayer = false;
static int buttonPressTime;
static bool nearbyFlag = false;
static int nearbyStartTime;

static void UART1_Init(void) {
	/* Pin configuration for UART. BSP_COM_Init() can do
	this automatically */
	__HAL_RCC_USART1_CLK_ENABLE();

	GPIO_InitTypeDef GPIO_InitStruct = {0};
	GPIO_InitStruct.Pin = ST_LINK_UART1_RX_Pin | ST_LINK_UART1_TX_Pin;
	GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
	/* Configuring UART1 */
	huart1.Instance = USART1;
	huart1.Init.BaudRate = 115200;
	huart1.Init.WordLength = UART_WORDLENGTH_8B;
	huart1.Init.StopBits = UART_STOPBITS_1;
	huart1.Init.Parity = UART_PARITY_NONE;
	huart1.Init.Mode = UART_MODE_TX_RX;
	huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart1.Init.OverSampling = UART_OVERSAMPLING_16;
	huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
	huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

	if (HAL_UART_Init(&huart1) != HAL_OK) {
		while(1);
	}
}

// GPIO
static void MX_GPIO_Init(void) {
	/* GPIO Ports Clock Enable */
	__HAL_RCC_GPIOA_CLK_ENABLE(); // LED 1
	__HAL_RCC_GPIOB_CLK_ENABLE(); // For LED 2
	__HAL_RCC_GPIOC_CLK_ENABLE(); // Enable AHB2 Bus for GPIOC for Button
	__HAL_RCC_GPIOD_CLK_ENABLE(); // For LSM6DSL

	// LED 1
	GPIO_InitTypeDef GPIO_InitStructLED1 = {0};
	/*Configure GPIO pin ARD_D13_Pin / LED1 */
	GPIO_InitStructLED1.Pin = ARD_D13_Pin;
	GPIO_InitStructLED1.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStructLED1.Pull = GPIO_NOPULL;
	GPIO_InitStructLED1.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(ARD_D13_GPIO_Port, &GPIO_InitStructLED1);
	HAL_GPIO_WritePin(ARD_D13_GPIO_Port, ARD_D13_Pin, GPIO_PIN_RESET);  // configure LED1 to LOW

	// LED 2
	GPIO_InitTypeDef GPIO_InitStructLED2 = {0};
	/*Configure GPIO pin LED2_Pin */
	GPIO_InitStructLED2.Pin = LED2_Pin;
	GPIO_InitStructLED2.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStructLED2.Pull = GPIO_NOPULL;
	GPIO_InitStructLED2.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(LED2_GPIO_Port, &GPIO_InitStructLED2);
	HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET);  // configure LED2 to LOW

	// BUTTON
	GPIO_InitTypeDef GPIO_InitStructButton = {0};
	// Configuration of BUTTON_EXTI13_Pin (GPIO-C Pin-13) as AF,
	GPIO_InitStructButton.Pin = BUTTON_EXTI13_Pin;
	GPIO_InitStructButton.Mode = GPIO_MODE_IT_FALLING;
	GPIO_InitStructButton.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(BUTTON_EXTI13_GPIO_Port, &GPIO_InitStructButton);

	// set INT1 EXTI 11 as interrupt for LSM6DSL
	GPIO_InitTypeDef GPIO_InitStructLSM6DSL = {0};
	GPIO_InitStructLSM6DSL.Pin = LSM6DSL_INT1_EXTI11_Pin;
	GPIO_InitStructLSM6DSL.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStructLSM6DSL.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(LSM6DSL_INT1_EXTI11_GPIO_Port, &GPIO_InitStructLSM6DSL);

	// Enable NVIC EXTI line 13
	HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

	// Buzzer
	GPIO_InitTypeDef GPIO_InitStructBuzzer = {0};
	/* Configuration of ARD_D4_Pin GPIO_PIN_3  ARD_D4_GPIO_Port GPIOA*/
	GPIO_InitStructBuzzer.Pin = ARD_D4_Pin;
	GPIO_InitStructBuzzer.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStructBuzzer.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(ARD_D4_GPIO_Port, &GPIO_InitStructBuzzer);
	HAL_GPIO_WritePin(ARD_D4_GPIO_Port, ARD_D4_Pin, GPIO_PIN_RESET);

	// Light Sensor
	__HAL_RCC_ADC_CLK_ENABLE();
	GPIO_InitTypeDef GPIO_InitStructLightSensor = {0};
	GPIO_InitStructLightSensor.Pin = ARD_A0_Pin;
	GPIO_InitStructLightSensor.Mode = GPIO_MODE_ANALOG_ADC_CONTROL;
	GPIO_InitStructBuzzer.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(ARD_A0_GPIO_Port, &GPIO_InitStructLightSensor);

	ADC_HandlerLightSensor.Instance = ADC1;
	ADC_HandlerLightSensor.Init.ClockPrescaler        = ADC_CLOCK_ASYNC_DIV4;
	ADC_HandlerLightSensor.Init.Resolution            = ADC_RESOLUTION_12B;
	ADC_HandlerLightSensor.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
	ADC_HandlerLightSensor.Init.ScanConvMode          = ADC_SCAN_DISABLE;
	ADC_HandlerLightSensor.Init.EOCSelection          = ADC_EOC_SINGLE_CONV;
	ADC_HandlerLightSensor.Init.ContinuousConvMode    = DISABLE;
	ADC_HandlerLightSensor.Init.NbrOfConversion       = 1;
	ADC_HandlerLightSensor.Init.DiscontinuousConvMode = DISABLE;
	ADC_HandlerLightSensor.Init.ExternalTrigConv      = ADC_SOFTWARE_START;
	ADC_HandlerLightSensor.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
	ADC_HandlerLightSensor.Init.Overrun               = ADC_OVR_DATA_PRESERVED;
	ADC_HandlerLightSensor.Init.OversamplingMode      = DISABLE;

