kilojoules-kj/EE2028-STM32/Core/Src/main.c
    return buffer[3];
}

void EnforcerOutput(void) {
	char message_print[16];
	char message[] = "Player Out!\r\n";
	sprintf(message_print, "%s", message);
	HAL_UART_Transmit(&huart1,(uint8_t*)message_print, strlen(message_print),0xFFFF);
}

void LEDBlinkHelper(int modulo) {
	if (HAL_GetTick() % modulo <= 10) {
		HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_14);
	}
}

uint16_t ReadLightSensorRaw(void) {
    HAL_ADC_Start(&ADC_HandlerLightSensor);
    HAL_ADC_PollForConversion(&ADC_HandlerLightSensor, 10);
    uint16_t val = (uint16_t)HAL_ADC_GetValue(&ADC_HandlerLightSensor);
    HAL_ADC_Stop(&ADC_HandlerLightSensor);
    return val; // 0..4095 for 12-bit
}

bool isLightSensor(void) {
	if (HAL_GPIO_ReadPin(ARD_A0_GPIO_Port, ARD_A0_Pin)) {
		return true;
	}
	return false;
}

void I2C_Write_Example(void) {
    uint8_t buf[] = {0x00, 0xAF};
    HAL_I2C_Master_Transmit(&hi2c1, SSD1308_ADDR, buf, sizeof(buf), 100 /*ms timeout*/);
}

static HAL_StatusTypeDef oled_write_data(const uint8_t *data, uint16_t len) {
    // We prepend the data control byte (0x40)
    // For large transfers, you can chunk it; this small helper sends in one go if len is modest.
    HAL_StatusTypeDef st;
    // stack-friendly small chunking
    uint16_t offset = 0;
    while (offset < len) {
        uint16_t chunk = (len - offset);
        if (chunk > 16) chunk = 16; // conservative chunk to avoid big I2C bursts
        uint8_t buf[1 + 16];
        buf[0] = 0x40;
        memcpy(&buf[1], &data[offset], chunk);
        st = HAL_I2C_Master_Transmit(&hi2c1, (uint16_t)SSD1308_ADDR, buf, (uint16_t)(1 + chunk), 100 /* I2C_TIMEOUT_MS */);
        if (st != HAL_OK) return st;
        offset += chunk;
    }
    return HAL_OK;
}
static HAL_StatusTypeDef oled_write_cmd(uint8_t cmd) {
    uint8_t b[2] = {0x00, cmd };
    return HAL_I2C_Master_Transmit(&hi2c1, (uint16_t)SSD1308_ADDR, b, sizeof(b), 100 /* I2C_TIMEOUT_MS */);
}

static HAL_StatusTypeDef oled_write_cmd2(uint8_t cmd0, uint8_t cmd1) {
    uint8_t b[3] = {0x00, cmd0, cmd1 };
    return HAL_I2C_Master_Transmit(&hi2c1, (uint16_t)SSD1308_ADDR, b, sizeof(b), 100 /* I2C_TIMEOUT_MS */);
}

static HAL_StatusTypeDef oled_clear() {
    HAL_StatusTypeDef st;

    // Make sure it shows RAM (not forced all-pixels-on) and normal polarity
    if ((st = oled_write_cmd(0xA4)) != HAL_OK) return st; // Resume RAM content display
    if ((st = oled_write_cmd(0xA6)) != HAL_OK) return st; // Normal (not inverted)

    // Horizontal addressing; full window
    if ((st = oled_write_cmd2(0x20, 0x00)) != HAL_OK) return st; // Addressing mode = horizontal
    if ((st = oled_write_cmd2(0x21, 0x00)) != HAL_OK) return st; // Column start
    if ((st = oled_write_cmd(127)) != HAL_OK) return st;         // Column end (0..127)
    if ((st = oled_write_cmd2(0x22, 0x00)) != HAL_OK) return st; // Page start
    if ((st = oled_write_cmd(7)) != HAL_OK) return st;           // Page end (0..7 for 64px)

    // Stream zeros across the whole screen: 128 cols × 8 pages = 1024 bytes
    uint8_t zeros[16] = {0};  // small chunk buffer
    for (int i = 0; i < (128 * 8) / (int)sizeof(zeros); i++) {
        st = oled_write_data(zeros, sizeof(zeros));  // prepends 0x40 inside helper
        if (st != HAL_OK) return st;
    }
    return HAL_OK;
}

static uint8_t g_fb[SSD1308_WIDTH * (SSD1308_HEIGHT/8)];   // 1,024 bytes
static const uint8_t font5x7[][5] = {
    // ' ' (32)
    {0x00,0x00,0x00,0x00,0x00},
    // '0'..'9' (48..57)
    {0x3E,0x51,0x49,0x45,0x3E}, // '0'
    {0x00,0x42,0x7F,0x40,0x00}, // '1'
    {0x42,0x61,0x51,0x49,0x46}, // '2'
    {0x21,0x41,0x45,0x4B,0x31}, // '3'
    {0x18,0x14,0x12,0x7F,0x10}, // '4'
    {0x27,0x45,0x45,0x45,0x39}, // '5'
    {0x3C,0x4A,0x49,0x49,0x30}, // '6'
    {0x01,0x71,0x09,0x05,0x03}, // '7'
    {0x36,0x49,0x49,0x49,0x36}, // '8'
    {0x06,0x49,0x49,0x29,0x1E}, // '9'
    // 'A'..'Z' (65..90)
    {0x7E,0x11,0x11,0x11,0x7E}, // 'A'
    {0x7F,0x49,0x49,0x49,0x36}, // 'B'
    {0x3E,0x41,0x41,0x41,0x22}, // 'C'
    {0x7F,0x41,0x41,0x22,0x1C}, // 'D'
    {0x7F,0x49,0x49,0x49,0x41}, // 'E'
    {0x7F,0x09,0x09,0x09,0x01}, // 'F'
    {0x3E,0x41,0x49,0x49,0x7A}, // 'G'
    {0x7F,0x08,0x08,0x08,0x7F}, // 'H'
    {0x00,0x41,0x7F,0x41,0x00}, // 'I'
    {0x20,0x40,0x41,0x3F,0x01}, // 'J'
    {0x7F,0x08,0x14,0x22,0x41}, // 'K'
    {0x7F,0x40,0x40,0x40,0x40}, // 'L'
    {0x7F,0x02,0x0C,0x02,0x7F}, // 'M'
    {0x7F,0x04,0x08,0x10,0x7F}, // 'N'
    {0x3E,0x41,0x41,0x41,0x3E}, // 'O'
    {0x7F,0x09,0x09,0x09,0x06}, // 'P'
    {0x3E,0x41,0x51,0x21,0x5E}, // 'Q'
    {0x7F,0x09,0x19,0x29,0x46}, // 'R'
    {0x46,0x49,0x49,0x49,0x31}, // 'S'
    {0x01,0x01,0x7F,0x01,0x01}, // 'T'
    {0x3F,0x40,0x40,0x40,0x3F}, // 'U'
    {0x1F,0x20,0x40,0x20,0x1F}, // 'V'
    {0x7F,0x20,0x18,0x20,0x7F}, // 'W'
    {0x63,0x14,0x08,0x14,0x63}, // 'X'
    {0x07,0x08,0x70,0x08,0x07}, // 'Y'
    {0x61,0x51,0x49,0x45,0x43}, // 'Z'
    // '-' '.' ':'
    {0x08,0x08,0x08,0x08,0x08}, // '-'
    {0x00,0x60,0x60,0x00,0x00}, // '.'
    {0x00,0x36,0x36,0x00,0x00}, // ':'
};
static inline const uint8_t* glyph_for(char c) {
    if (c == ' ') return font5x7[0];
    if (c >= '0' && c <= '9') return font5x7[1 + (c - '0')];
    if (c >= 'A' && c <= 'Z') return font5x7[11 + (c - 'A')];
    if (c == '-') return font5x7[11 + 26];
    if (c == '.') return font5x7[11 + 27];
    if (c == ':') return font5x7[11 + 28];
    // Fallback: blank
    return font5x7[0];
}
static void fb_set_pixel(int x, int y, int on) {
    if (x < 0 || x >= SSD1308_WIDTH || y < 0 || y >= SSD1308_HEIGHT) return;
    int page = y >> 3;
    uint8_t bit = 1u << (y & 7);
    uint8_t *b = &g_fb[page * SSD1308_WIDTH + x];
    if (on) *b |= bit;
    else    *b &= (uint8_t)~bit;
}

static void fb_clear(void) {
    memset(g_fb, 0x00, sizeof(g_fb));
}

// Draw a 5x7 glyph with 1px spacing; returns advance (6 px)
static int fb_draw_char(int x, int y, char c) {
    const uint8_t *g = glyph_for(c);
    for (int col = 0; col < 5; col++) {
        uint8_t colbits = g[col]; // bit0 = top pixel
        for (int row = 0; row < 7; row++) {
            int on = (colbits >> row) & 1;
            fb_set_pixel(x + col, y + row, on);
        }
    }
    // 1 column spacing
    for (int row = 0; row < 7; row++) fb_set_pixel(x + 5, y + row, 0);
    return 6;
}
static void fb_draw_text(int x, int y, const char *s) {
    int cx = x;
    while (*s) {
        if (*s == '\n') { y += 8; cx = x; s++; continue; }
        cx += fb_draw_char(cx, y, *s++);
        if (cx > SSD1308_WIDTH - 6) { y += 8; cx = x; } // wrap to next row
        if (y > SSD1308_HEIGHT - 8) break;
    }
}
static HAL_StatusTypeDef oled_flush_full(void) {
    HAL_StatusTypeDef st;
    // Follow RAM & normal polarity (safety)
    if ((st = oled_write_cmd(0xA4)) != HAL_OK) return st;
    if ((st = oled_write_cmd(0xA6)) != HAL_OK) return st;
    // Horizontal addressing; full window
    if ((st = oled_write_cmd2(0x20, 0x00)) != HAL_OK) return st; // horizontal
    if ((st = oled_write_cmd2(0x21, 0x00)) != HAL_OK) return st; // col start
    if ((st = oled_write_cmd(SSD1308_WIDTH - 1)) != HAL_OK) return st;  // col end
    if ((st = oled_write_cmd2(0x22, 0x00)) != HAL_OK) return st; // page start
    if ((st = oled_write_cmd((SSD1308_WIDTH/8) - 1)) != HAL_OK) return st; // page end

    // Send whole buffer in small chunks
    // (Each oled_write_data prepends control byte 0x40)
    for (int off = 0; off < (int)sizeof(g_fb); ) {
        int chunk = 16;
        if (off + chunk > (int)sizeof(g_fb)) chunk = (int)sizeof(g_fb) - off;
        st = oled_write_data(&g_fb[off], (uint16_t)chunk);
        if (st != HAL_OK) return st;
        off += chunk;
    }
    return HAL_OK;
}
void demo_text() {
    fb_clear();
    fb_draw_text(0, 0, "HELLO WORLD");
    fb_draw_text(0, 8, "T E S T TEST TTT");
    fb_draw_text(0, 16, "1.2:3.4:5.6:7.8:9");
    fb_draw_text(0, 24, "SUCK MY BALLS");
    fb_draw_text(0, 32, "JIA DE");
    oled_flush_full();
}

// Custom Class for Switching
typedef struct {
	const char *name;
	void (*initialise)(void);
	void (*update)(void);
	void (*exit)(void);
} State;

void RedLightGreenLight_initialise(void);
void RedLightGreenLight_update(void);
void RedLightGreenLight_exit(void);
void CatchAndRun_initialise(void);
void CatchAndRun_update(void);
void CatchAndRun_exit(void);

// Implementation for RedLightGreenLight State
void RedLightGreenLight_initialise(void) {
	if (isPlayer) {
		char message[] = "Entering Red Light, Green Light as Player\r\n"; // Fixed message

