kilojoules-kj/EE2028-STM32/Core/Src/main.c
		char message_print[64];
		sprintf(message_print, "%s", message);
		HAL_UART_Transmit(&huart1,(uint8_t*)message_print, strlen(message_print),0xFFFF);

	} else {
		char message[] = "Entering Red Light, Green Light as Enforcer\r\n"; // Fixed message

		char message_print[64];
		sprintf(message_print, "%s", message);
		HAL_UART_Transmit(&huart1,(uint8_t*)message_print, strlen(message_print),0xFFFF);
	}
}
void RedLightGreenLight_update(void) {
	static bool isGreen = false;

	// timing shit
	static uint32_t lastToggle = 0;
	static uint32_t lastLEDToggle = 0;

	// compare movement
	static float lastAccel[4] = {0};
	static float lastGyro[4]  = {0};
	static bool lastCaptured = false;

	if (HAL_GetTick() - lastToggle >= 10000) {
        lastToggle = HAL_GetTick();

		char message_print[32]; // UART	transmit buffer.
		if (!isGreen) { // if isGreen =/= true, at the start is false -> true
			char message[] = "Green Light!\r\n";
			sprintf(message_print, "%s", message);
			isGreen = true;

			lastCaptured = false;
		} else {
			char message[] = "Red Light!\r\n";
			sprintf(message_print, "%s", message);
			isGreen = false;
		}

		HAL_UART_Transmit(&huart1,(uint8_t*)message_print, strlen(message_print),0xFFFF);
	}


	if (isGreen) {
		HAL_GPIO_WritePin(ARD_D13_GPIO_Port, ARD_D13_Pin, GPIO_PIN_SET);
		HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET);
		lastCaptured = false;

		if (HAL_GetTick() % 2000 < 10) {
			TemperatureSensorHelper(true);
			PressureSensorHelper(true);
			HumiditySensorHelper(true);
		}
	} else {
		if (!lastCaptured) {
			AccelerometerHelper(lastAccel);
			GyroscopeHelper(lastGyro);
			lastCaptured = true;
		}

		if (HAL_GetTick() - lastLEDToggle >= 500) {
			HAL_GPIO_TogglePin(ARD_D13_GPIO_Port, ARD_D13_Pin);
			HAL_GPIO_TogglePin(LED2_GPIO_Port, LED2_Pin);

		    lastLEDToggle = HAL_GetTick();
		}

		if (HAL_GetTick() % 2000 < 10) {
			float accelThreshold = 0.8f; // m/s², mild movement
			float gyroThreshold  = 1.5f; // deg/s, mild rotation -> this sensor noise is way too high

			float accelData[4], gyroData[4];
			AccelerometerHelper(accelData);
			GyroscopeHelper(gyroData);

			for (int i; i<4; i++) {
				lastGyro[i] = gyroData[i];
				lastAccel[i] = accelData[i];
			}

			if (isPlayer && (fabs(accelData[3] - lastAccel[3]) > accelThreshold) && (fabs(gyroData[3]  - lastGyro[3]) > gyroThreshold)) {
				endState();
				return;
			} else if (!isPlayer && (fabs(accelData[3] - lastAccel[3]) > accelThreshold) && (fabs(gyroData[3]  - lastGyro[3]) > gyroThreshold)) {
				EnforcerOutput();
			}
		}
	}
}

void RedLightGreenLight_exit(void) {
    char message[] = "--- State Exiting: RedLightGreenLight ---\r\n"; // Fixed message
	char message_print[64];
	sprintf(message_print, "%s", message);
	HAL_UART_Transmit(&huart1,(uint8_t*)message_print, strlen(message_print),0xFFFF);
}

// Implementation for CatchAndRun State
void CatchAndRun_initialise(void) {
    char message_print[80];

    if (isPlayer) {
        sprintf(message_print, "Entering Catch And Run as Player\r\n");
    } else {
        sprintf(message_print, "Entering Catch And Run as Enforcer\r\n");
    }

    HAL_UART_Transmit(&huart1, (uint8_t*)message_print, strlen(message_print), 0xFFFF);

	// Ensure LED starts OFF for controlled blinking
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_14, GPIO_PIN_RESET);
}
void CatchAndRun_update(void) {
	if (HAL_GetTick() % 1000 < 10) {
		// Tested in dorm room
//		Temp = 33.67 deg C
//		Pressure = 1008.35
//		Humidity = 63.11

		float tempThreshold = 35.0f; // m/s², mild movement
		float pressureThreshold  = 1030.0f;
		float humidityThreshold = 80.0;

		float temp = TemperatureSensorHelper(false);
		if (temp > tempThreshold) {
			char tempMessage[80];
			sprintf(tempMessage, "Temperature spike detected! T: %.2fC. Dangerous environment!\r\n" , temp);
			HAL_UART_Transmit(&huart1, (uint8_t*)tempMessage, strlen(tempMessage), 0xFFFF);
		}

		float pressure = PressureSensorHelper(false);
		if (pressure > pressureThreshold) {
			char pressureMessage[80];
			sprintf(pressureMessage, "Pressure spike detected! P: %.1fhPa. Dangerous environment!\r\n" , pressure);
			HAL_UART_Transmit(&huart1, (uint8_t*)pressureMessage, strlen(pressureMessage), 0xFFFF);
		}

		float humidity = HumiditySensorHelper(false);
		if (humidity > humidityThreshold) {
			char humidityMessage[80];
			sprintf(humidityMessage, "Humidity spike detected! H: %.1f%%. Dangerous environment!\r\n" , humidity);
			HAL_UART_Transmit(&huart1, (uint8_t*)humidityMessage, strlen(humidityMessage), 0xFFFF);
		}
	}

	float magnetData[4];
	MagnetometerHelper(magnetData); // constant continuous
	float magnetoThreshold = 400.0f;

	if (isPlayer && magnetData[3] > magnetoThreshold) {
		if (nearbyFlag == false) {
			nearbyStartTime = HAL_GetTick();
			nearbyFlag = true;
		}

		if (HAL_GetTick() % 500 < 10) {
			char magnetoMessage[80];
			sprintf(magnetoMessage, "Enforcer nearby! Be careful.\r\n");
			HAL_UART_Transmit(&huart1, (uint8_t*)magnetoMessage, strlen(magnetoMessage), 0xFFFF);
		}

	} else if (!isPlayer && magnetData[3] > magnetoThreshold){
		if (nearbyFlag == false) {
			nearbyStartTime = HAL_GetTick();
			nearbyFlag = true;
		}

		if (HAL_GetTick() % 500 < 10) {
			char magnetoMessage[80];
			sprintf(magnetoMessage, "Player is Nearby! Move faster.\r\n");
			HAL_UART_Transmit(&huart1, (uint8_t*)magnetoMessage, strlen(magnetoMessage), 0xFFFF);
		}
	}

	if (HAL_GetTick() - nearbyStartTime > 3000 && isPlayer && nearbyFlag) {
		endState();
	} else if (HAL_GetTick() - nearbyStartTime > 3000 && !isPlayer && nearbyFlag) {
		nearbyFlag = false;
		char chaseMessage[64];
		sprintf(chaseMessage, "Player escaped! Keep trying.\r\n");
		HAL_UART_Transmit(&huart1, (uint8_t*)chaseMessage, strlen(chaseMessage), 0xFFFF);
	}

	// LED Blinking
	if (magnetData[3] > magnetoThreshold && magnetData[3] < (magnetoThreshold + 100)) {
		LEDBlinkHelper(600);
	} else if (magnetData[3] > (magnetoThreshold + 100) && magnetData[3] < (magnetoThreshold + 200)) {
		LEDBlinkHelper(200);
	} else if (magnetData[3] > (magnetoThreshold + 200)) {
		LEDBlinkHelper(50);
	}
}
void CatchAndRun_exit(void) {
    char message[] = "--- State Exiting: CatchAndRun ---\r\n"; // Fixed message
	char message_print[64];
	sprintf(message_print, "%s", message);
	HAL_UART_Transmit(&huart1,(uint8_t*)message_print, strlen(message_print),0xFFFF);
}

// State variable
State* currentState;         // Pointer
// Define the two states
State RedLightGreenLightState = {
    .name = "RedLightGreenLight",
    .initialise = RedLightGreenLight_initialise,
    .update = RedLightGreenLight_update,
    .exit = RedLightGreenLight_exit
};

State CatchAndRunState = {
    .name = "CatchAndRun",
    .initialise = CatchAndRun_initialise,
    .update = CatchAndRun_update,
    .exit = CatchAndRun_exit
};

// Running flag
volatile bool programRunning = true;

void toggleState(void) {
	if (currentState == &RedLightGreenLightState) {
		currentState->exit();
		currentState = &CatchAndRunState;
	} else if (currentState == &CatchAndRunState) {
		currentState->exit();
		currentState = &RedLightGreenLightState;
	}

	currentState->initialise();
}

void endState(void) {
	char message_print[16];
	char message[] = "Game Over\r\n";
	sprintf(message_print, "%s", message);
	HAL_UART_Transmit(&huart1,(uint8_t*)message_print, strlen(message_print),0xFFFF);
	programRunning = false;
}


void setup(void) {
	// initialise_monitor_handles(); // for semi-hosting support (printf)

	/* Peripheral initializations using BSP functions */
	BSP_TSENSOR_Init();
	BSP_PSENSOR_Init();
	BSP_HSENSOR_Init();
	BSP_ACCELERO_Init();
	BSP_GYRO_Init();
	BSP_MAGNETO_Init();

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	// GPIO Pins
	MX_GPIO_Init();
	SENSOR_IO_Write(0xD4, 0x0D, 0x03);

	/* UART initialization */
	UART1_Init();

	I2C_Write_Example(); // on screen
	oled_clear();
	demo_text();

	// My state machine
	currentState = &RedLightGreenLightState;
	currentState->initialise();
}


// Main Program Code
int main(void) {
	setup();

  	while (programRunning) {
		currentState->update();
	}
}
